# perryescape Brewfile — one `brew bundle` to install everything
# Usage: brew bundle --file=Brewfile

# Core CLI tools
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "htop"
brew "tmux"
brew "tree"
brew "imagemagick"
brew "ffmpeg"
brew "yq"
brew "tldr"
brew "pandoc"

# Development
brew "python@3.11"
brew "node"
brew "rust"
brew "go"
brew "lua"
brew "zig"
brew "bun"

# Git tooling
brew "gh"
brew "git-lfs"
brew "lazygit"

# Shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "oh-my-posh"

# Misc useful
brew "neovim"
brew "httpie"
brew "telnet"
brew "watch"
brew "mas"
brew "pngquant"
brew "gifsicle"

# Casks — apps
cask "brave-browser"
cask "arc"
cask "cursor"
cask "visual-studio-code"
cask "telegram"
cask "iterm2"
cask "raycast"
cask "spotify"
cask "docker"
cask "vlc"

# Mac App Store (use `mas` IDs)
# mas "Xcode", id: 497799835
